examples/render_all_grammars/dot/tests_functional_test_scoping_interface_model2_Interface.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


34677080 -> 34981288[arrowtail=diamond, dir=both, headlabel="packages 0..*"]
34677080[ label="{Model|}"]

34981288 -> 34992360[arrowtail=diamond, dir=both, headlabel="interfaces 1..*"]
34981288 -> 34981288[arrowtail=diamond, dir=both, headlabel="packages 1..*"]
34981288 -> 34986824[arrowtail=diamond, dir=both, headlabel="raw_types 1..*"]
34981288[ label="{Package|+name:ID\l}"]

34986824[ label="{RawType|+name:ID\l}"]

34992360 -> 34997896[arrowtail=diamond, dir=both, headlabel="attributes 0..*"]
34992360[ label="{Interface|+name:ID\l}"]

34997896[ label="{*Attribute|}"]
34997896 -> 35003432 [dir=back]
34997896 -> 35008968 [dir=back]

35003432 -> 34986824[headlabel="ref "]
35003432[ label="{RawTypeAttribute|+name:ID\l}"]

35008968 -> 34992360[headlabel="ref "]
35008968[ label="{EmbeddedAttribute|+name:ID\l}"]

35014504[ label="{FQN|FQN}"]

35020040[ label="{Comment|\\/\\/.*$}"]

34511160[ label="{ID|}"]

34427544[ label="{STRING|}"]

34807400[ label="{BOOL|}"]

32378600[ label="{INT|}"]

34653608[ label="{FLOAT|}"]

34658552[ label="{STRICTFLOAT|}"]

34625512[ label="{NUMBER|}"]
34625512 -> 34658552 [dir=back]
34625512 -> 32378600 [dir=back]

34964520[ label="{BASETYPE|}"]
34964520 -> 34625512 [dir=back]
34964520 -> 34653608 [dir=back]
34964520 -> 34807400 [dir=back]
34964520 -> 34511160 [dir=back]
34964520 -> 34427544 [dir=back]

34970056[ label="{*OBJECT|}"]
34970056 -> 34964520 [dir=back]


}
